# Напиши програм који који исцртава ћилим састављен од звездица (квадрат из чије је средине уклоњен ромб,
# како је приказано у примерима).
#
# Улаз: Са стандардног улаза се учитава број n (1 ≤ n ≤ 20).
#
# Излаз: На стандардни излаз исписати ћилим.
#
# Пример 1
# Улаз
# 3
# Излаз
# ******
# **  **
# *    *
# **  **
# ******
# Пример 2
# Улаз
# 4
# Излаз
# ********
# ***  ***
# **    **
# *      *
# **    **
# ***  ***
# ********

n = int(input("Unesi broj: "))
k=0

for i in range(2*n):
    if i < n:
        print((n-k)*"*",sep="", end="")
        print(k*"  ",sep="", end="")
        print((n-k)*"*",sep="", end="")
        k=k+1
        print()
    else:
        k = k - 1
        print((n - k) * "*", sep="", end="")
        print(k * "  ", sep="", end="")
        print((n - k) * "*", sep="", end="")
        print()
