# На часу ликовног ђаци су добили задатак да за предстојећу трку око центра града, од већ постојећих квадратних комада старих застава, направе правоугаону заставу димензија која ће, као што је на аутомобилским
# тркама обичај бити карирана, црно-бела. Након завршеног шивења, видели су да им није баш све ишло од
# руке. Циљ који треба да постигну је да ниједно црно поље нема за суседно бело, и обрнуто (суседна поља су
# лево, десно, горње и доње) и зато морају још да префарбају поља заставе која нису ваљана са што мање боје.
# Напиши програм који одређује колико најмање поља морају да офарбају.
#
# Улаз: У првој линији улаза налазе се два цела броја одвојена размаком r и k (1 ≤ r, k ≤ 3000), број редова
# и број колона заставе. Следећих r редова садржи по k знакова C или B (без размака).
#
# Излаз: У једини ред излаза треба исписати један цео број који представља минималан број квадратних
# делова заставе које је потребно префарбати да би се добила црно бела карирана застава.
#
# Пример 1
# Улаз
# 3 3
# CCC
# CCC
# CCC
# Излаз
# 4
#
# Пример 2
# Улаз
# 3 4
# CBCB
# BCBC
# CBCB
# Излаз
# 0
#
# Пример 3
# Улаз
# 4 2
# BC
# BC
# CB
# BC
# Излаз
# 2


(r, k) = map(int, input("Unesi broj redova i broj kolona: ").split())
m = 0

for i in range(r):
    str = input("Unesi shodno unetom broju kolona identican broj C-crnih ili B-Belih slova/polja: ")
    for j in range(k):
        if str[j] == 'B' and (i + j) % 2 == 0:
            m += 1
        if str[j] == 'C' and (i + j) % 2 != 0:
            m += 1

print("Minimalni broj kvadrata zastave koji treba prefarbati: ", min(r * k - m, m))
