# Напиши програм који исцртава квадрат од карактера * (као што је приказано у примерима).
#
# Улаз: Са стандардног улаза се учитава природан број n (1 ≤ n ≤ 20), који представља димензију квадрата
# (број звездица у свакој врсти и колони).
#
# Излаз: На стандардни излаз исписати тражени цртеж.
#
# Пример
# Улаз
# 4
# Излаз
# ****
# ****
# ****
# ****

n = int(input("Uneti dimenziju stranice kvadrata od 1 do 20: "))
for i in range(n):
    for j in range(n):
        print("*", sep="", end="")
    print()
