# Напиши програм који исписује ромб направљен од звездица (како је приказано у примеру).
#
# Улаз: Са стандардног улаза се уноси природан број n (3 ≤ n ≤ 20),
# који представља димензију ромба (број врста и колона).
#
# Излаз: На стандардни излаз исцртати ромб.
#
# Пример
# Улаз
# 5
# Излаз
#     *****
#    *****
#   *****
#  *****
# *****

n = int(input("Uneti visinu romba u broju redova: "))

for i in range(n):
    for j in range(n-i-1):
        print(" ", sep="", end="")
    for j in range(n):
        print("*", sep="", end="")
    print()
