# Напиши програм који исписује таблицу множења.
#
# Улаз: Са стандардног улаза се уносе два цела броја m и n (1 ≤ m, n ≤ 9), сваки у посебном реду.
#
# Излаз: На стандардни излаз исписати таблицу множења са m врста и n колона, како је приказано у примеру.
# Између колона штампати табулатор (карактер Tab).
#
# Пример
# Улаз
# 5
# 5
# Излаз
# 1 * 1 = 1  1 * 2 = 2   1 * 3 = 3   1 * 4 = 4   1 * 5 = 5
# 2 * 1 = 2  2 * 2 = 4   2 * 3 = 6   2 * 4 = 8   2 * 5 = 10
# 3 * 1 = 3  3 * 2 = 6   3 * 3 = 9   3 * 4 = 12  3 * 5 = 15
# 4 * 1 = 4  4 * 2 = 8   4 * 3 = 12  4 * 4 = 16  4 * 5 = 20
# 5 * 1 = 5  5 * 2 = 10  5 * 3 = 15  5 * 4 = 20  5 * 5 = 25

n = int(input("Uneti broj redova: "))
m = int(input("Uneti broj kolona: "))

for i in range(1,n+1):
    for j in range(1,m+1):
        print(i," * ",j, " = ",i*j,"  "if i*j<10 else " ", sep="",end="")
    print()
