# Напиши програм који исцртава троугао какав је приказан у примеру.
#
# Улаз: Са стандардног улаза се учитава један природан број n (1 ≤ n ≤ 30), који представља висину троугла
# (број редова које цртеж садржи).
#
# Излаз: На стандардни излаз се исписује тражени троугао, исписивањем карактера *,
# размака (карактера бланко) и преласка у нови ред. После сваке последње звездице у свакој врсти прећи
# у наредни ред (не исписивати размаке после звездица).
#
# Пример
# Улаз
# 4
# Излаз
#    *
#   ***
#  *****
# *******

n = int(input("Uneti visinu trougla u broju redova: "))

for i in range(n):
    for j in range(n-i-1):
        print(" ", sep="", end="")
    for j in range(2*i+1):
        print("*", sep="", end="")
    print()
