# Напиши програм који који исцртава латиничко слово V састављено од звездица.
# Слово се простире у n редова и n колона.
#
# Улаз: Са стандардног улаза се учитава број n (1 ≤ n ≤ 20).
#
# Излаз: На стандардни излаз исписати звездице, као у примерима.
#
# Пример 1
# Улаз
# 3
# Излаз
# *    *
# *    *
#  *  *
#  *  *
#   **
#   **
#
# Пример 2
# Улаз
# 4
# Излаз
# *      *
# *      *
#  *    *
#  *    *
#   *  *
#   *  *
#    **
#    **

n = int(input("Unesi broj: "))

for i in range(n):
        print(i* " ", sep="", end="")
        print("*",sep="", end="")
        print((n - i - 1) * "  ", sep="", end="")
        print("*",sep="")
        print(i* " ", sep="", end="")
        print("*",sep="", end="")
        print((n - i - 1) * "  ", sep="", end="")
        print("*",sep="")
